// 1. Primitive Colors (ベースカラー)

export const primitiveColors = {
  gray: {
    100: '#FFFFFF',
    90: '#F8F8F8',
    80: '#EEEEEE',
    70: '#DEDEDE',
    60: '#CECECE',
    50: '#BCBCBC',
    40: '#A1A1A1',
    30: '#808080',
    20: '#5F5F5F',
    10: '#3C3C3C',
    5: '#1F1F1F',
  },
  red: {
    90: '#FDECEC',
    80: '#FCDADA',
    70: '#F9B4B4',
    60: '#F58F8F',
    50: '#F26969',
    40: '#EF4444',
    30: '#C13737',
    20: '#932929',
    10: '#661C1C',
    5: '#4F1515',
  },
  blue: {
    90: '#EEFAFF',
    80: '#D6EFF9',
    70: '#99D0E8',
    60: '#66B9DC',
    50: '#30A0D1',
    40: '#008AC5',
    30: '#006E9E',
    20: '#005376',
    10: '#00374F',
    5: '#00293B',
  },
  green: {
    90: '#F1FEF8',
    80: '#C4F0DB',
    70: '#97E2BF',
    60: '#6AD3A2',
    50: '#3DC586',
    40: '#10B769',
    30: '#0D9254',
    20: '#0A6E3F',
    10: '#06492A',
    5: '#053720',
  },
} as const;

// 2. Theme Colors (プリミティブカラーを参照)

// 3. Semantic Colors (テーマカラーを参照)
